import random


def play_game(option):
    """
    Игра "Камень-ножницы-бумага" против бота.

    Функция принимает выбор пользователя, генерирует случайный выбор бота,
    сравнивает выборы по правилам игры и возвращает результат в виде строки.

    Правила:
        - Камень побеждает ножницы.
        - Ножницы побеждают бумагу.
        - Бумага побеждает камень.
        - Одинаковые выборы - ничья.

    Args:
        option (str): Выбор пользователя. Должен быть одним из:'🗿 камень', '✂ ножницы', '📃 бумага'.

    Returns:
        str: Описание результата игры в виде строки.
    """
    user_choice = option
    bot_choice = random.choice(['🗿 камень', '✂ ножницы', '📃 бумага'])
    if user_choice == bot_choice:
        return f'Вы выбрали {user_choice}, и я выбрал {bot_choice}, ничья!'
    elif (user_choice == '🗿 камень' and bot_choice == '✂ ножницы') or \
        (user_choice == '✂ ножницы' and bot_choice == '📃 бумага') or \
        (user_choice == '📃 бумага' and bot_choice == '🗿 камень'):
        return f'Вы выбрали {user_choice}, и я выбрал {bot_choice}, поздравляю, вы победили!'
    else:
        return f'Вы выбрали {user_choice}, а я выбрал {bot_choice}, вы проиграли.'


if __name__ == '__main__':
    alternative = input('Введите: камень, ножницы или бумага\n')
    alternative = play_game(alternative)
    print(alternative)
